testGroups.push({
  name: 'Prayer of the Three Kayas',
  includeInPercentage: true,
  sentences: true,
  tests: [
    // ÉÊ ÊU¨-#<ß0#<ë:-7+è/<-,ÜÊ
    { tibetan: 'ཨེ་མ་ཧོཿ སྤྲོས་བྲལ་ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཞིང་ཁམས་སུ༔', conversion: `>è-0-=ëï ‡ë<-o:-&ë<-\`Ü-+eÜ$<-\`Ü-5Ü$-"0<-<ßÎ` },
    { tibetan: 'ཆོས་ཉིད་དུས་གསུམ་སྐྱེ་འགགས་མེད་པའི་ངང་༔', conversion: `&ë<-(Ü+-¸¥<-#<ß0-þè-7##<-0è+-ý7Ü-$$-Î` },
    { tibetan: 'བྱ་བྲལ་ལྷུན་རྫོགས་བདེ་བ་ཆེན་པོའི་སྐུ༔', conversion: `e-o:-T©,-Jë#<-/+è-/-&è,-ýë7Ü-U¨Î` },
    { tibetan: 'ནམ་མཁའ་བཞིན་དུ་ཐུགས་རྗེ་ཕྱོགས་རིས་མེད༔', conversion: `,0-0"7-/5Ü,-¸¥-*ß#<-Bè-dë#<-9Ü<-0è+Î` },
    { tibetan: 'བླ་མ་ཆོས་ཀྱི་སྐུ་ལ་གསོལ་བ་འདེབས༔', conversion: `v-0-&ë<-\`Ü-U¨-:-#<ë:-/-7+è/<Î` },
    { tibetan: 'ཨོ་རྒྱན་པདྨ་འབྱུང་གནས་ལ་གསོལ་བ་འདེབས༔', conversion: `>ë-{,-ýV-7e³$-#,<-:-#<ë:-/-7+è/<Î` },
    { tibetan: 'བདེ་ཆེན་ལྷུན་གྱིས་གྲུབ་པའི་ཞིང་ཁམས་སུ༔', conversion: `/+è-&è,-T©,-bÜ<-iá/-ý7Ü-5Ü$-"0<-<ßÎ` },
    { tibetan: 'སྐུ་གསུང་ཐུགས་དང་ཡོན་ཏན་ཕྲིན་ལས་ཀྱི༔', conversion: `U¨-#<ß$-*ß#<-+$-8ë,-),-nÜ,-:<-\`ÜÎ` },
    { tibetan: 'ཡེ་ཤེས་ལྔ་ལྡན་བདེ་བར་གཤེགས་པའི་སྐུ༔', conversion: `8è-;è<-M-Q,-/+è-/9-#;è#<-ý7Ü-U¨Î` },
    { tibetan: 'ཐུགས་རྗེའི་བྱེ་བྲག་སྣ་ཚོགས་སོ་སོར་སྟོན༔', conversion: `*ß#<-Bè7Ü-eè-o#-[-2ì#<-<ë-<ë9-Yë,Î` },
    { tibetan: 'བླ་མ་ལོངས་སྤྱོད་རྫོགས་སྐུ་ལ་གསོལ་བ་འདེབས༔', conversion: `v-0-:ë$<-ë+-Jë#<-U¨-:-#<ë:-/-7+è/<Î` },
    { tibetan: 'ཨོ་རྒྱན་པདྨ་འབྱུང་གནས་ལ་གསོལ་བ་འདེབས༔', conversion: `>ë-{,-ýV-7e³$-#,<-:-#<ë:-/-7+è/<Î` },
    { tibetan: 'མི་འབྱེད་འཇིག་རྟེན་དག་པའི་ཞིང་ཁམས་སུ༔', conversion: `0Ü-7eè+-7'Ü#-Dè,-+#-ý7Ü-5Ü$-"0<-<ßÎ` },
    { tibetan: 'ཐུགས་རྗེ་ཆེན་པོ་འགྲོ་བའི་དོན་ལ་བྱོན༔', conversion: `*ß#<-Bè-&è,-ýë-7ië-/7Ü-+ë,-:-eë,Î` },
    { tibetan: 'གང་ལ་གང་འདུལ་ཐབས་ཀྱིས་འགྲོ་དོན་མཛད༔', conversion: `#$-:-#$-7¸¥:-*/<-\`Ü<-7ië-+ë,-03+Î` },
    { tibetan: 'འདས་དང་མ་བྱོན་ད་ལྟ་དུས་གསུམ་གྱི༔', conversion: `7+<-+$-0-eë,-+-P-¸¥<-#<ß0-μbÜÎ` },
    { tibetan: 'བླ་མ་སྤྲུལ་པའི་སྐུ་ལ་གསོལ་བ་འདེབས༔', conversion: `v-0-‡å:-ý7Ü-U¨-:-#<ë:-/-7+è/<Î` },
    { tibetan: 'ཨོ་རྒྱན་པདྨ་འབྱུང་གནས་ལ་གསོལ་བ་འདེབས༔', conversion: `>ë-{,-ýV-7e³$-#,<-:-#<ë:-/-7+è/<Î` }
  ]
});
