
var app;
$(function() {
  app = new Vue({
    el: '#main',
    data: {
      encoded: `
        ÉÊ Êa/-/+#-+$-ýë7Ü-<$<-{<-´¥,-·â-/6$-Ê Ê
        6ß$-7'ß#-€ç-7ná:-8è-;è<-Eë-Bè-<è0<Ê Ê
        7/9-/7Ü-U¨9-[$-/‰-´¥-0¡-9Ê Ê
        #<ë:-/-7+è/<-<ë-nÜ,-:<-0*9-dÜ,-;ë# Ê

        #<$-/7Ü-03ì+-73Ý,-/+è-/7Ü-7"ë9-:ë-&èÊ Ê
        nÜ,-:<-8ë$<-iá/-7ë+-6è9-u$-ýë7Ü-5/<Ê Ê
        =è-9ß-!-+ý:-Eë-Bè-*ë+-nè$-I:Ê Ê
        #<ë:-/-7+è/<-<ë-nÜ,-:<-0*9-dÜ,-;ë# Ê

        /!7-//<-*ß#<-\`Ü-#6ß$<-0-0"9-&è,-/67Ê Ê
        6/-#<$-{-7ië:-#)è9-7eÜ,-‡å:-ý7Ü-U¨Ê Ê
        U:-Q,-&ë<-/+#-I-/{æ+-v-0-:Ê Ê
        #<ë:-/-7+è/<-<ë-nÜ,-:<-0*9-dÜ,-;ë#

        [$-i#<-9Ü#-ý-+\`Ü:-7"ë9-#<ß0-¸¥-+# Ê
        *:-7eÜ,-F0-/5Ü7Ü-iá/-0*7-2+-¸¥-7aë:Ê Ê
        Ië:-0è+-nÜ,-:<-&#<-*ë#<-0Ü-0$7-/<Ê Ê
        /¸¥+-:<-F0-{:-#ë-7.$-0&ë#-*ë/-;ë# Ê%è<-ý7$-7'Ü#<-o:-
        8è-;è<-Eë-Bè<-<ëÊ Ê+#è7ëÊÊ
      `.replace(/^[ ]*/gm, '').trim(),
      tibetan: `
        ༄༅། །ཁྱབ་བདག་དང་པོའི་སངས་རྒྱས་ཀུན་ཏུ་བཟང་། །
        ཟུང་འཇུག་སྒྱུ་འཕྲུལ་ཡེ་ཤེས་རྡོ་རྗེ་སེམས། །
        འབར་བའི་སྐུར་སྣང་བཛྲ་ཀུ་མཱ་ར། །
        གསོལ་བ་འདེབས་སོ་ཕྲིན་ལས་མཐར་ཕྱིན་ཤོག །

        གསང་བའི་མཛོད་འཛིན་བདེ་བའི་འཁོར་ལོ་ཆེ། །
        ཕྲིན་ལས་ཡོངས་གྲུབ་འོད་ཟེར་གླང་པོའི་ཞབས། །
        ཧེ་རུ་ཀ་དཔལ་རྡོ་རྗེ་ཐོད་ཕྲེང་རྩལ། །
        གསོལ་བ་འདེབས་སོ་ཕྲིན་ལས་མཐར་ཕྱིན་ཤོག །

        བཀའ་བབས་ཐུགས་ཀྱི་གཟུངས་མ་མཁར་ཆེན་བཟའ། །
        ཟབ་གསང་རྒྱ་འགྲོལ་གཏེར་འབྱིན་སྤྲུལ་པའི་སྐུ། །
        སྐལ་ལྡན་ཆོས་བདག་རྩ་བརྒྱུད་བླ་མ་ལ། །
        གསོལ་བ་འདེབས་སོ་ཕྲིན་ལས་མཐར་ཕྱིན་ཤོག

        སྣང་གྲགས་རིག་པ་དཀྱིལ་འཁོར་གསུམ་དུ་དག །
        ཐལ་འབྱིན་རྣམ་བཞིའི་གྲུབ་མཐའ་ཚད་དུ་འཁྱོལ། །
        རྩོལ་མེད་ཕྲིན་ལས་ཆགས་ཐོགས་མི་མངའ་བས། །
        བདུད་ལས་རྣམ་རྒྱལ་གོ་འཕང་མཆོག་ཐོབ་ཤོག །ཅེས་པའང་འཇིགས་བྲལ་
        ཡེ་ཤེས་རྡོ་རྗེས་སོ། །དགེའོ།།
      `.replace(/^[ ]*/gm, '').trim()
    },
    computed: {
      lines: function() {
        return this.encoded.split("\n").map((line, index) => {
          return [line, new TibetanUnicodeConverter(line).convert()];
        }).flatten();
      }
    },
    template: `
      <div class="ui container compare">
        <div id="scrollable-area-container">
          <div id="scrollable-area">
            <div class="form">
              <textarea
                id="encoded"
                v-model="encoded"
                v-on:paste="encoded = $event"
              ></textarea>
            </div>
            <div id="tibetan" style="position: absolute; left: -9999999;"></div>
            <div class="form">
              <div id="converted">
                <div
                  v-for="(line, index) in lines"
                  :class="{
                    encoded: index % 2 == 0,
                    tibetan: index % 2 == 1,
                  }">
                  {{line}}
                </div>
              </div>
            </div>
          </div>
        </div>
      </div>
    `
  })
})